app/controllers/school_classes_controller.rb

    def create
         @school_class = SchoolClass.create(title: params[:school_class][:title] , room_number: params[:school_class][:room_number])
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Software Engineering"], ["room_number", 45], ["created_at", "2020-04-30 22:15:01.321821"], ["updated_at", "2020-04-30 22:15:01.321821"]]

    def update
        @school_class = SchoolClass.update(title: params[:school_class][:title], room_number: params[:school_class][:title])
---
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Mechanical Engineering"], ["room_number", 0], ["updated_at", "2020-04-30 22:18:12.209998"], ["id", 1]]