app/controllers/students_controller.rb

    def update
        @student = Student.update(first_name: params[:student][:first_name], last_name: params[:student][:last_name])
---
UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Jenessa"], ["updated_at", "2020-05-01 00:05:39.095233"], ["id", 1]]